test_reports/performance_profiling_nodeprofiler/assignUserToLab.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/labs/assign
Document Length:        33 bytes

Concurrency Level:      20
Time taken for tests:   0.101 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      90500 bytes
HTML transferred:       8250 bytes
Requests per second:    2476.33 [#/sec] (mean)
Time per request:       8.076 [ms] (mean)
Time per request:       0.404 [ms] (mean, across all concurrent requests)
Transfer rate:          875.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1    8   1.6      7      15
Waiting:        1    8   1.7      7      15
Total:          1    8   1.7      7      15

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      8
  90%      9
  95%      9
  98%     13
  99%     15
 100%     15 (longest request)