test_reports/performance_profiling_nodeprofiler/createItemSet.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/itemsets/create
Document Length:        38 bytes

Concurrency Level:      20
Time taken for tests:   0.171 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      92500 bytes
HTML transferred:       9500 bytes
Requests per second:    1463.85 [#/sec] (mean)
Time per request:       13.663 [ms] (mean)
Time per request:       0.683 [ms] (mean, across all concurrent requests)
Transfer rate:          528.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   13   3.0     12      21
Waiting:        1   13   3.0     12      21
Total:          3   13   3.0     12      21

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     14
  80%     15
  90%     17
  95%     17
  98%     19
  99%     19
 100%     21 (longest request)