test_reports/performance_profiling_nodeprofiler/createRequestItem.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/requestitems/create
Document Length:        57 bytes

Concurrency Level:      20
Time taken for tests:   0.158 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      97000 bytes
HTML transferred:       14250 bytes
Requests per second:    1583.19 [#/sec] (mean)
Time per request:       12.633 [ms] (mean)
Time per request:       0.632 [ms] (mean, across all concurrent requests)
Transfer rate:          599.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   12   3.8     10      26
Waiting:        3   12   3.8     10      26
Total:          4   12   3.8     10      26

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     14
  75%     15
  80%     16
  90%     17
  95%     18
  98%     20
  99%     20
 100%     26 (longest request)