test_reports/performance_profiling_nodeprofiler/getItemRequestUsingToken.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/requestitems/HkU37OYS8fknaK2SpL6l2n1jSWi7h~6qfWVDpRrZcfmZKL02Bw58yWMTMJ9qPv5iIxwxFWyUHMLUNSnkMQI_mEt~-STGL_6z
Document Length:        28 bytes

Concurrency Level:      20
Time taken for tests:   1.654 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       7000 bytes
Requests per second:    151.18 [#/sec] (mean)
Time per request:       132.290 [ms] (mean)
Time per request:       6.615 [ms] (mean, across all concurrent requests)
Transfer rate:          53.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    55  125  33.0    117     283
Waiting:       55  125  33.0    117     282
Total:         55  125  33.0    117     284

Percentage of the requests served within a certain time (ms)
  50%    117
  66%    125
  75%    131
  80%    134
  90%    148
  95%    202
  98%    258
  99%    258
 100%    284 (longest request)