test_reports/performance_profiling_nodeprofiler/getItemsInLab.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/labs/1f9c67f8-7b89-4392-b616-79f5e0257cfd/items
Document Length:        27 bytes

Concurrency Level:      20
Time taken for tests:   0.142 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       6750 bytes
Requests per second:    1761.58 [#/sec] (mean)
Time per request:       11.353 [ms] (mean)
Time per request:       0.568 [ms] (mean, across all concurrent requests)
Transfer rate:          617.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   11   2.5     11      20
Waiting:        1   11   2.6     11      20
Total:          3   11   2.5     11      20

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     12
  80%     12
  90%     13
  95%     14
  98%     18
  99%     19
 100%     20 (longest request)