test_reports/performance_profiling_nodeprofiler/lendTemporaryRequestItem.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/temporyrequests/lend
Document Length:        33 bytes

Concurrency Level:      20
Time taken for tests:   0.125 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      90500 bytes
HTML transferred:       8250 bytes
Requests per second:    2001.18 [#/sec] (mean)
Time per request:       9.994 [ms] (mean)
Time per request:       0.500 [ms] (mean, across all concurrent requests)
Transfer rate:          707.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2   10   3.5      8      17
Waiting:        1    9   3.5      8      17
Total:          2   10   3.5      8      17

Percentage of the requests served within a certain time (ms)
  50%      8
  66%     10
  75%     13
  80%     13
  90%     15
  95%     16
  98%     17
  99%     17
 100%     17 (longest request)