test_reports/performance_profiling_nodeprofiler/listAllRequests.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/requestitems/requester/list
Document Length:        38 bytes

Concurrency Level:      20
Time taken for tests:   0.157 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      92500 bytes
HTML transferred:       9500 bytes
Requests per second:    1593.28 [#/sec] (mean)
Time per request:       12.553 [ms] (mean)
Time per request:       0.628 [ms] (mean, across all concurrent requests)
Transfer rate:          575.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   12   2.9     12      22
Waiting:        2   12   2.9     12      22
Total:          3   12   2.9     12      22

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     12
  75%     13
  80%     13
  90%     15
  95%     16
  98%     18
  99%     20
 100%     22 (longest request)