test_reports/performance_profiling_nodeprofiler/loginUsingCredentials.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/login
Document Length:        33 bytes

Concurrency Level:      20
Time taken for tests:   0.186 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      90500 bytes
HTML transferred:       8250 bytes
Requests per second:    1344.85 [#/sec] (mean)
Time per request:       14.872 [ms] (mean)
Time per request:       0.744 [ms] (mean, across all concurrent requests)
Transfer rate:          475.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   14   3.8     14      36
Waiting:        1   14   3.9     14      36
Total:          4   14   3.8     14      36

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     16
  80%     16
  90%     18
  95%     20
  98%     21
  99%     22
 100%     36 (longest request)