test_reports/performance_profiling_nodeprofiler/output1.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/registration/verify
Document Length:        33 bytes

Concurrency Level:      20
Time taken for tests:   0.144 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      90500 bytes
HTML transferred:       8250 bytes
Requests per second:    1736.86 [#/sec] (mean)
Time per request:       11.515 [ms] (mean)
Time per request:       0.576 [ms] (mean, across all concurrent requests)
Transfer rate:          614.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   11   2.8     10      28
Waiting:        1   11   2.9     10      28
Total:          4   11   2.9     10      29

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     12
  80%     12
  90%     15
  95%     16
  98%     18
  99%     18
 100%     29 (longest request)