test_reports/performance_profiling_nodeprofiler/output10.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/roles/list
Document Length:        27 bytes

Concurrency Level:      20
Time taken for tests:   0.192 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       6750 bytes
Requests per second:    1302.82 [#/sec] (mean)
Time per request:       15.351 [ms] (mean)
Time per request:       0.768 [ms] (mean, across all concurrent requests)
Transfer rate:          456.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   15   3.1     15      24
Waiting:        1   14   3.1     15      24
Total:          3   15   3.1     15      24

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     15
  75%     16
  80%     16
  90%     18
  95%     19
  98%     23
  99%     24
 100%     24 (longest request)